cf_billing/Documents/бестИзменениеРасчетаКоэффициентовРеактивнойЭнергии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестИзменениеРасчетаКоэффициентовРеактивнойЭнергии</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестКоэффициентОпределенияТарифаРеактивнойЭнергии</xr:Item>
				<xr:Item>InformationRegister.бестКоэффициентОпределенияОбъемаРеактивнойЭнергии</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьКоэффициентОбъема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентОпределенияОбъема</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьКоэффициентТарифа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентОпределенияТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/бестКоэффициентОпределенияОбъемаРеактивнойЭнергии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестКоэффициентОпределенияОбъемаРеактивнойЭнергии</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоэффициентОпределенияОбъема</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестКоэффициентОпределенияТарифаРеактивнойЭнергии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестКоэффициентОпределенияТарифаРеактивнойЭнергии</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоэффициентОпределенияТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Documents/бестИзменениеРасчетаКоэффициентовРеактивнойЭнергии/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли; 
	
	Если ЭтотОбъект.КоэффициентОпределенияОбъема = 0 И ЭтотОбъект.КоэффициентОпределенияТарифа = 0 Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный 			= Пользователи.ТекущийПользователь();
	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ДанныеШапки = ДанныеШапки();
	
	Если  Не ЭтотОбъект.КоэффициентОпределенияОбъема = 0 Тогда 
		
		Набор  										= Движения.бестКоэффициентОпределенияОбъемаРеактивнойЭнергии;
		Запись  									= Набор.добавить();
		Запись.Период  								= ДанныеШапки.Дата;
		Запись.Организация  						= ДанныеШапки.Организация;
		Запись.Услуга								= ДанныеШапки.Услуга;
		Запись.КоэффициентОпределенияОбъема			= ДанныеШапки.КоэффициентОпределенияОбъема;
		
	КонецЕсли;
	
	Если Не ЭтотОбъект.КоэффициентОпределенияТарифа = 0 Тогда
		
		Набор  										= Движения.бестКоэффициентОпределенияТарифаРеактивнойЭнергии;
		Запись  									= Набор.добавить();
		Запись.Период  								= ДанныеШапки.Дата;
		Запись.Организация  						= ДанныеШапки.Организация;
		Запись.Услуга								= ДанныеШапки.Услуга;
		Запись.КоэффициентОпределенияТарифа			= ДанныеШапки.КоэффициентОпределенияТарифа;
		
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеШапки()	
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Дата",									Дата);
	ДанныеШапки.Вставить("Организация",								Организация);
	ДанныеШапки.Вставить("Услуга",									Услуга);
	ДанныеШапки.Вставить("ИзменитьКоэффициентОбъема",				ИзменитьКоэффициентОбъема);
	ДанныеШапки.Вставить("КоэффициентОпределенияОбъема",			КоэффициентОпределенияОбъема);
	ДанныеШапки.Вставить("ИзменитьКоэффициентТарифа",				ИзменитьКоэффициентТарифа);
	ДанныеШапки.Вставить("КоэффициентОпределенияТарифа",			КоэффициентОпределенияТарифа);
	Возврат ДанныеШапки;
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
